vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE13Z7_DFP.pdsc
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.device=MKE13Z7.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MKE13Z7.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.serial_manager, driver.common, utility.str, device=MKE13Z7.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MKE13Z7.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=MKE13Z7.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="cmake_toolchain" Cversion="1.0.0" condition="cmake_toolchain.condition_id">
      <description>Cmake_toolchain</description>
      <files>
        <file category="other" name="tools/cmake_toolchain_files/armgcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xclang.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/armgcc_force_cpp.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/mcux_config.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/riscvllvm.cmake" projectpath="cmake_toolchain_files"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="cmsis_drivers" Cversion="2.0.0" condition="component.cmsis_drivers.condition_id">
      <description>CMSIS driver</description>
      <files>
        <file category="doc" name="components/cmsis_drivers/component.cmsis_drivers_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="component.lists.condition_id">
      <description>Component lists</description>
      <files>
        <file category="header" name="components/lists/fsl_component_generic_list.h" projectpath="component/lists"/>
        <file category="sourceC" name="components/lists/fsl_component_generic_list.c" projectpath="component/lists"/>
        <file category="include" name="components/lists/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="log" Cversion="1.0.0" condition="component.log.condition_id">
      <description>Component log</description>
      <files>
        <file category="header" name="components/log/fsl_component_log.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log.c" projectpath="component/log"/>
        <file category="header" name="components/log/fsl_component_log_config.h" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole" Cversion="1.0.0" condition="component.log.backend.debug_console.condition_id">
      <description>Component log backend debug console</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole_lite" Cversion="1.0.0" condition="component.log.backend.debug_console_lite.condition_id">
      <description>Component log backend debug console lite</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ringbuffer" Cversion="1.0.0" condition="component.log.backend.ringbuffer.condition_id">
      <description>Component log backend ring buffer</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_ringbuffer.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_ringbuffer.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter" Cversion="1.0.0" condition="component.lpspi_adapter.condition_id">
      <description>Component lpspi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h" projectpath="component/spi"/>
        <file category="sourceC" name="components/spi/fsl_adapter_lpspi.c" projectpath="component/spi"/>
        <file category="include" name="components/spi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="component.lpuart_adapter.condition_id">
      <description>Component lpuart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_lpuart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="component.serial_manager.condition_id">
      <description>Component serial_manager</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h" projectpath="component/serial_manager"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="component.serial_manager_spi.condition_id">
      <description>Component serial_manager_spi</description>
      <RTE_Components_h>
        #ifndef SERIAL_PORT_TYPE_SPI
        #define SERIAL_PORT_TYPE_SPI 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_MASTER
        #define SERIAL_PORT_TYPE_SPI_MASTER 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_SLAVE
        #define SERIAL_PORT_TYPE_SPI_SLAVE 1
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
        #define SERIAL_MANAGER_NON_BLOCKING_MODE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="component.serial_manager_swo.condition_id">
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="component.serial_manager_uart.condition_id">
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="component.serial_manager_virtual.condition_id">
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE13Z7_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MKE13Z7_cmsis</description>
      <files>
        <file category="header" name="devices/MKE13Z7/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MKE13Z7/MKE13Z7.h" projectpath="device"/>
        <file category="header" name="devices/MKE13Z7/MKE13Z7_features.h" projectpath="device"/>
        <file category="header" name="devices/MKE13Z7/MKE13Z7_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_ADC.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_CMP.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_CRC.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_DMA.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_DMAMUX.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_EWM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_FGPIO.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_FLEXIO.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_FTFA.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_FTM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_GPIO.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_LPI2C.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_LPIT.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_LPSPI.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_LPTMR.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_LPUART.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_MCM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_MTB.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_MTBDWT.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_NV.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_PCC.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_PMC.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_PORT.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_PWT.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_RCM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_ROM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_SCG.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_SIM.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_SMC.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_TRGMUX.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_TSI.h" projectpath="device/periph7"/>
        <file category="header" name="devices/MKE13Z7/periph7/PERI_WDOG.h" projectpath="device/periph7"/>
        <file category="include" name="devices/MKE13Z7/"/>
        <file category="include" name="devices/MKE13Z7/periph7/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MKE13Z7/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE13Z7/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MKE13Z7_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MKE13Z7_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/arm/MKE13Z128xxx7_flash.scf" version="1.0.0" projectpath="MKE13Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/arm/MKE13Z128xxx7_ram.scf" version="1.0.0" projectpath="MKE13Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/arm/MKE13Z256xxx7_flash.scf" version="1.0.0" projectpath="MKE13Z7/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/arm/MKE13Z256xxx7_ram.scf" version="1.0.0" projectpath="MKE13Z7/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/gcc/MKE13Z128xxx7_flash.ld" version="1.0.0" projectpath="MKE13Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/gcc/MKE13Z128xxx7_ram.ld" version="1.0.0" projectpath="MKE13Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/gcc/MKE13Z256xxx7_flash.ld" version="1.0.0" projectpath="MKE13Z7/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/gcc/MKE13Z256xxx7_ram.ld" version="1.0.0" projectpath="MKE13Z7/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/iar/MKE13Z128xxx7_flash.icf" version="1.0.0" projectpath="MKE13Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE13Z128xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/iar/MKE13Z128xxx7_ram.icf" version="1.0.0" projectpath="MKE13Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/iar/MKE13Z256xxx7_flash.icf" version="1.0.0" projectpath="MKE13Z7/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE13Z256xxx7.condition_id" category="linkerScript" attr="config" name="devices/MKE13Z7/iar/MKE13Z256xxx7_ram.icf" version="1.0.0" projectpath="MKE13Z7/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE13Z7" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MKE13Z7</description>
      <files>
        <file category="header" attr="config" name="devices/MKE13Z7/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE13Z7/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE13Z7/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE13Z7/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE13Z7/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE13Z7/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE13Z7/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE13Z7/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE13Z7/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MKE13Z7_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MKE13Z7/iar/startup_MKE13Z7.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MKE13Z7/gcc/startup_MKE13Z7.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MKE13Z7/arm/startup_MKE13Z7.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
